node {
  name: "images"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 80
        }
        dim {
          size: 80
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "labels"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 80
        }
        dim {
          size: 80
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "validation_images"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 384
        }
        dim {
          size: 324
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "validation_labels"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 384
        }
        dim {
          size: 324
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "u_net/conv1_1/W_conv2d/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_1/W_conv2d"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\003\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "u_net/conv1_1/W_conv2d/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_1/W_conv2d"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "u_net/conv1_1/W_conv2d/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_1/W_conv2d"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.009999999776482582
      }
    }
  }
}
node {
  name: "u_net/conv1_1/W_conv2d/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "u_net/conv1_1/W_conv2d/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_1/W_conv2d"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "u_net/conv1_1/W_conv2d/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "u_net/conv1_1/W_conv2d/Initializer/truncated_normal/TruncatedNormal"
  input: "u_net/conv1_1/W_conv2d/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_1/W_conv2d"
      }
    }
  }
}
node {
  name: "u_net/conv1_1/W_conv2d/Initializer/truncated_normal"
  op: "Add"
  input: "u_net/conv1_1/W_conv2d/Initializer/truncated_normal/mul"
  input: "u_net/conv1_1/W_conv2d/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_1/W_conv2d"
      }
    }
  }
}
node {
  name: "u_net/conv1_1/W_conv2d"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_1/W_conv2d"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "u_net/conv1_1/W_conv2d/Assign"
  op: "Assign"
  input: "u_net/conv1_1/W_conv2d"
  input: "u_net/conv1_1/W_conv2d/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_1/W_conv2d"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "u_net/conv1_1/W_conv2d/read"
  op: "Identity"
  input: "u_net/conv1_1/W_conv2d"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_1/W_conv2d"
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/Rank"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/range"
  op: "Range"
  input: "u_net/conv1_1/summaries/range/start"
  input: "u_net/conv1_1/summaries/Rank"
  input: "u_net/conv1_1/summaries/range/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/Mean"
  op: "Mean"
  input: "u_net/conv1_1/W_conv2d/read"
  input: "u_net/conv1_1/summaries/range"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/mean/Weights/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "u_net/conv1_1/summaries/mean/Weights"
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/mean/Weights"
  op: "ScalarSummary"
  input: "u_net/conv1_1/summaries/mean/Weights/tags"
  input: "u_net/conv1_1/summaries/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/stddev/sub"
  op: "Sub"
  input: "u_net/conv1_1/W_conv2d/read"
  input: "u_net/conv1_1/summaries/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/stddev/Square"
  op: "Square"
  input: "u_net/conv1_1/summaries/stddev/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/stddev/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/stddev/Sum"
  op: "Sum"
  input: "u_net/conv1_1/summaries/stddev/Square"
  input: "u_net/conv1_1/summaries/stddev/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/stddev/Sqrt"
  op: "Sqrt"
  input: "u_net/conv1_1/summaries/stddev/Sum"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/sttdev/Weights/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "u_net/conv1_1/summaries/sttdev/Weights"
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/sttdev/Weights"
  op: "ScalarSummary"
  input: "u_net/conv1_1/summaries/sttdev/Weights/tags"
  input: "u_net/conv1_1/summaries/stddev/Sqrt"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/Rank_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/range_1/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/range_1/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/range_1"
  op: "Range"
  input: "u_net/conv1_1/summaries/range_1/start"
  input: "u_net/conv1_1/summaries/Rank_1"
  input: "u_net/conv1_1/summaries/range_1/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/Max"
  op: "Max"
  input: "u_net/conv1_1/W_conv2d/read"
  input: "u_net/conv1_1/summaries/range_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/max/Weights/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "u_net/conv1_1/summaries/max/Weights"
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/max/Weights"
  op: "ScalarSummary"
  input: "u_net/conv1_1/summaries/max/Weights/tags"
  input: "u_net/conv1_1/summaries/Max"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/Rank_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/range_2/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/range_2/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/range_2"
  op: "Range"
  input: "u_net/conv1_1/summaries/range_2/start"
  input: "u_net/conv1_1/summaries/Rank_2"
  input: "u_net/conv1_1/summaries/range_2/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/Min"
  op: "Min"
  input: "u_net/conv1_1/W_conv2d/read"
  input: "u_net/conv1_1/summaries/range_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/min/Weights/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "u_net/conv1_1/summaries/min/Weights"
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries/min/Weights"
  op: "ScalarSummary"
  input: "u_net/conv1_1/summaries/min/Weights/tags"
  input: "u_net/conv1_1/summaries/Min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_1/b_conv2d/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_1/b_conv2d"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "u_net/conv1_1/b_conv2d"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_1/b_conv2d"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "u_net/conv1_1/b_conv2d/Assign"
  op: "Assign"
  input: "u_net/conv1_1/b_conv2d"
  input: "u_net/conv1_1/b_conv2d/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_1/b_conv2d"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "u_net/conv1_1/b_conv2d/read"
  op: "Identity"
  input: "u_net/conv1_1/b_conv2d"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_1/b_conv2d"
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/Rank"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/range"
  op: "Range"
  input: "u_net/conv1_1/summaries_1/range/start"
  input: "u_net/conv1_1/summaries_1/Rank"
  input: "u_net/conv1_1/summaries_1/range/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/Mean"
  op: "Mean"
  input: "u_net/conv1_1/b_conv2d/read"
  input: "u_net/conv1_1/summaries_1/range"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/mean/Biases/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "u_net/conv1_1/summaries_1/mean/Biases"
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/mean/Biases"
  op: "ScalarSummary"
  input: "u_net/conv1_1/summaries_1/mean/Biases/tags"
  input: "u_net/conv1_1/summaries_1/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/stddev/sub"
  op: "Sub"
  input: "u_net/conv1_1/b_conv2d/read"
  input: "u_net/conv1_1/summaries_1/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/stddev/Square"
  op: "Square"
  input: "u_net/conv1_1/summaries_1/stddev/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/stddev/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/stddev/Sum"
  op: "Sum"
  input: "u_net/conv1_1/summaries_1/stddev/Square"
  input: "u_net/conv1_1/summaries_1/stddev/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/stddev/Sqrt"
  op: "Sqrt"
  input: "u_net/conv1_1/summaries_1/stddev/Sum"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/sttdev/Biases/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "u_net/conv1_1/summaries_1/sttdev/Biases"
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/sttdev/Biases"
  op: "ScalarSummary"
  input: "u_net/conv1_1/summaries_1/sttdev/Biases/tags"
  input: "u_net/conv1_1/summaries_1/stddev/Sqrt"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/Rank_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/range_1/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/range_1/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/range_1"
  op: "Range"
  input: "u_net/conv1_1/summaries_1/range_1/start"
  input: "u_net/conv1_1/summaries_1/Rank_1"
  input: "u_net/conv1_1/summaries_1/range_1/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/Max"
  op: "Max"
  input: "u_net/conv1_1/b_conv2d/read"
  input: "u_net/conv1_1/summaries_1/range_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/max/Biases/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "u_net/conv1_1/summaries_1/max/Biases"
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/max/Biases"
  op: "ScalarSummary"
  input: "u_net/conv1_1/summaries_1/max/Biases/tags"
  input: "u_net/conv1_1/summaries_1/Max"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/Rank_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/range_2/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/range_2/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/range_2"
  op: "Range"
  input: "u_net/conv1_1/summaries_1/range_2/start"
  input: "u_net/conv1_1/summaries_1/Rank_2"
  input: "u_net/conv1_1/summaries_1/range_2/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/Min"
  op: "Min"
  input: "u_net/conv1_1/b_conv2d/read"
  input: "u_net/conv1_1/summaries_1/range_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/min/Biases/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "u_net/conv1_1/summaries_1/min/Biases"
      }
    }
  }
}
node {
  name: "u_net/conv1_1/summaries_1/min/Biases"
  op: "ScalarSummary"
  input: "u_net/conv1_1/summaries_1/min/Biases/tags"
  input: "u_net/conv1_1/summaries_1/Min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_1/Conv2D"
  op: "Conv2D"
  input: "images"
  input: "u_net/conv1_1/W_conv2d/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "u_net/conv1_1/add"
  op: "Add"
  input: "u_net/conv1_1/Conv2D"
  input: "u_net/conv1_1/b_conv2d/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_1/Relu"
  op: "Relu"
  input: "u_net/conv1_1/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_2/W_conv2d/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_2/W_conv2d"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000@\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "u_net/conv1_2/W_conv2d/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_2/W_conv2d"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "u_net/conv1_2/W_conv2d/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_2/W_conv2d"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.009999999776482582
      }
    }
  }
}
node {
  name: "u_net/conv1_2/W_conv2d/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "u_net/conv1_2/W_conv2d/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_2/W_conv2d"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "u_net/conv1_2/W_conv2d/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "u_net/conv1_2/W_conv2d/Initializer/truncated_normal/TruncatedNormal"
  input: "u_net/conv1_2/W_conv2d/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_2/W_conv2d"
      }
    }
  }
}
node {
  name: "u_net/conv1_2/W_conv2d/Initializer/truncated_normal"
  op: "Add"
  input: "u_net/conv1_2/W_conv2d/Initializer/truncated_normal/mul"
  input: "u_net/conv1_2/W_conv2d/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_2/W_conv2d"
      }
    }
  }
}
node {
  name: "u_net/conv1_2/W_conv2d"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_2/W_conv2d"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 64
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "u_net/conv1_2/W_conv2d/Assign"
  op: "Assign"
  input: "u_net/conv1_2/W_conv2d"
  input: "u_net/conv1_2/W_conv2d/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_2/W_conv2d"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "u_net/conv1_2/W_conv2d/read"
  op: "Identity"
  input: "u_net/conv1_2/W_conv2d"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_2/W_conv2d"
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/Rank"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/range"
  op: "Range"
  input: "u_net/conv1_2/summaries/range/start"
  input: "u_net/conv1_2/summaries/Rank"
  input: "u_net/conv1_2/summaries/range/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/Mean"
  op: "Mean"
  input: "u_net/conv1_2/W_conv2d/read"
  input: "u_net/conv1_2/summaries/range"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/mean/Weights/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "u_net/conv1_2/summaries/mean/Weights"
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/mean/Weights"
  op: "ScalarSummary"
  input: "u_net/conv1_2/summaries/mean/Weights/tags"
  input: "u_net/conv1_2/summaries/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/stddev/sub"
  op: "Sub"
  input: "u_net/conv1_2/W_conv2d/read"
  input: "u_net/conv1_2/summaries/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/stddev/Square"
  op: "Square"
  input: "u_net/conv1_2/summaries/stddev/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/stddev/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/stddev/Sum"
  op: "Sum"
  input: "u_net/conv1_2/summaries/stddev/Square"
  input: "u_net/conv1_2/summaries/stddev/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/stddev/Sqrt"
  op: "Sqrt"
  input: "u_net/conv1_2/summaries/stddev/Sum"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/sttdev/Weights/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "u_net/conv1_2/summaries/sttdev/Weights"
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/sttdev/Weights"
  op: "ScalarSummary"
  input: "u_net/conv1_2/summaries/sttdev/Weights/tags"
  input: "u_net/conv1_2/summaries/stddev/Sqrt"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/Rank_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/range_1/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/range_1/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/range_1"
  op: "Range"
  input: "u_net/conv1_2/summaries/range_1/start"
  input: "u_net/conv1_2/summaries/Rank_1"
  input: "u_net/conv1_2/summaries/range_1/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/Max"
  op: "Max"
  input: "u_net/conv1_2/W_conv2d/read"
  input: "u_net/conv1_2/summaries/range_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/max/Weights/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "u_net/conv1_2/summaries/max/Weights"
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/max/Weights"
  op: "ScalarSummary"
  input: "u_net/conv1_2/summaries/max/Weights/tags"
  input: "u_net/conv1_2/summaries/Max"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/Rank_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/range_2/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/range_2/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/range_2"
  op: "Range"
  input: "u_net/conv1_2/summaries/range_2/start"
  input: "u_net/conv1_2/summaries/Rank_2"
  input: "u_net/conv1_2/summaries/range_2/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/Min"
  op: "Min"
  input: "u_net/conv1_2/W_conv2d/read"
  input: "u_net/conv1_2/summaries/range_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/min/Weights/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "u_net/conv1_2/summaries/min/Weights"
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries/min/Weights"
  op: "ScalarSummary"
  input: "u_net/conv1_2/summaries/min/Weights/tags"
  input: "u_net/conv1_2/summaries/Min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_2/b_conv2d/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_2/b_conv2d"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "u_net/conv1_2/b_conv2d"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_2/b_conv2d"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "u_net/conv1_2/b_conv2d/Assign"
  op: "Assign"
  input: "u_net/conv1_2/b_conv2d"
  input: "u_net/conv1_2/b_conv2d/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_2/b_conv2d"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "u_net/conv1_2/b_conv2d/read"
  op: "Identity"
  input: "u_net/conv1_2/b_conv2d"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/conv1_2/b_conv2d"
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/Rank"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/range"
  op: "Range"
  input: "u_net/conv1_2/summaries_1/range/start"
  input: "u_net/conv1_2/summaries_1/Rank"
  input: "u_net/conv1_2/summaries_1/range/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/Mean"
  op: "Mean"
  input: "u_net/conv1_2/b_conv2d/read"
  input: "u_net/conv1_2/summaries_1/range"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/mean/Biases/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "u_net/conv1_2/summaries_1/mean/Biases"
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/mean/Biases"
  op: "ScalarSummary"
  input: "u_net/conv1_2/summaries_1/mean/Biases/tags"
  input: "u_net/conv1_2/summaries_1/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/stddev/sub"
  op: "Sub"
  input: "u_net/conv1_2/b_conv2d/read"
  input: "u_net/conv1_2/summaries_1/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/stddev/Square"
  op: "Square"
  input: "u_net/conv1_2/summaries_1/stddev/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/stddev/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/stddev/Sum"
  op: "Sum"
  input: "u_net/conv1_2/summaries_1/stddev/Square"
  input: "u_net/conv1_2/summaries_1/stddev/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/stddev/Sqrt"
  op: "Sqrt"
  input: "u_net/conv1_2/summaries_1/stddev/Sum"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/sttdev/Biases/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "u_net/conv1_2/summaries_1/sttdev/Biases"
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/sttdev/Biases"
  op: "ScalarSummary"
  input: "u_net/conv1_2/summaries_1/sttdev/Biases/tags"
  input: "u_net/conv1_2/summaries_1/stddev/Sqrt"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/Rank_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/range_1/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/range_1/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/range_1"
  op: "Range"
  input: "u_net/conv1_2/summaries_1/range_1/start"
  input: "u_net/conv1_2/summaries_1/Rank_1"
  input: "u_net/conv1_2/summaries_1/range_1/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/Max"
  op: "Max"
  input: "u_net/conv1_2/b_conv2d/read"
  input: "u_net/conv1_2/summaries_1/range_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/max/Biases/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "u_net/conv1_2/summaries_1/max/Biases"
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/max/Biases"
  op: "ScalarSummary"
  input: "u_net/conv1_2/summaries_1/max/Biases/tags"
  input: "u_net/conv1_2/summaries_1/Max"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/Rank_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/range_2/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/range_2/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/range_2"
  op: "Range"
  input: "u_net/conv1_2/summaries_1/range_2/start"
  input: "u_net/conv1_2/summaries_1/Rank_2"
  input: "u_net/conv1_2/summaries_1/range_2/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/Min"
  op: "Min"
  input: "u_net/conv1_2/b_conv2d/read"
  input: "u_net/conv1_2/summaries_1/range_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/min/Biases/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "u_net/conv1_2/summaries_1/min/Biases"
      }
    }
  }
}
node {
  name: "u_net/conv1_2/summaries_1/min/Biases"
  op: "ScalarSummary"
  input: "u_net/conv1_2/summaries_1/min/Biases/tags"
  input: "u_net/conv1_2/summaries_1/Min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_2/Conv2D"
  op: "Conv2D"
  input: "u_net/conv1_1/Relu"
  input: "u_net/conv1_2/W_conv2d/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "u_net/conv1_2/add"
  op: "Add"
  input: "u_net/conv1_2/Conv2D"
  input: "u_net/conv1_2/b_conv2d/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/conv1_2/Relu"
  op: "Relu"
  input: "u_net/conv1_2/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "u_net/bn1/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/bn1/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "u_net/bn1/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/bn1/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "u_net/bn1/beta/Assign"
  op: "Assign"
  input: "u_net/bn1/beta"
  input: "u_net/bn1/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/bn1/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "u_net/bn1/beta/read"
  op: "Identity"
  input: "u_net/bn1/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/bn1/beta"
      }
    }
  }
}
node {
  name: "u_net/bn1/gamma/Initializer/random_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/bn1/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 64
      }
    }
  }
}
node {
  name: "u_net/bn1/gamma/Initializer/random_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/bn1/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "u_net/bn1/gamma/Initializer/random_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@u_net/bn1/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.019999999552965164
      }
    }
  }
}
node {
  name: "u_net/bn1/gamma/Initializer/random_normal/RandomStandardNormal"
